OF21x/ALM12/constant/airfoilProperties/DU290-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.0257888888888889 )
( -175 0.287333333333333 0.0365777777777778 )
( -170 0.573777777777778 0.0965444444444444 )
( -160 0.683333333333333 0.286855555555556 )
( -155 0.764111111111111 0.401466666666667 )
( -150 0.813888888888889 0.521866666666667 )
( -145 0.834 0.643788888888889 )
( -140 0.829888888888889 0.7637 )
( -135 0.802 0.878533333333333 )
( -130 0.754111111111111 0.985788888888889 )
( -125 0.688333333333333 1.08347777777778 )
( -120 0.607555555555556 1.17017777777778 )
( -115 0.513888888888889 1.24442222222222 )
( -110 0.410111111111111 1.3053 )
( -105 0.299333333333333 1.35201111111111 )
( -100 0.181666666666667 1.38424444444444 )
( -95 0.0608888888888889 1.40151111111111 )
( -90 -0.0608888888888889 1.40371111111111 )
( -85 -0.182555555555556 1.39084444444444 )
( -80 -0.301222222222222 1.3632 )
( -75 -0.415 1.32091111111111 )
( -70 -0.521777777777778 1.26463333333333 )
( -65 -0.620444444444444 1.19498888888889 )
( -60 -0.706333333333333 1.11296666666667 )
( -55 -0.779111111111111 1.01957777777778 )
( -50 -0.836 0.916511111111111 )
( -45 -0.874777777777778 0.805466666666667 )
( -40 -0.892777777777778 0.688733333333333 )
( -35 -0.886777777777778 0.568922222222222 )
( -30 -0.855777777777778 0.449211111111111 )
( -25 -0.827444444444444 0.334577777777778 )
( -24 -0.845555555555556 0.313211111111111 )
( -23 -0.873444444444444 0.292555555555556 )
( -22 -0.908111111111111 0.272466666666667 )
( -21 -0.949666666666667 0.253044444444444 )
( -20 -0.997 0.2343 )
( -19 -1.04833333333333 0.216266666666667 )
( -18 -1.10344444444444 0.198944444444444 )
( -17 -1.16044444444444 0.182277777777778 )
( -16 -1.21766666666667 0.166355555555556 )
( -15.25 -1.2605 0.154930555555556 )
( -14.24 -1.20798572066042 0.135823248549755 )
( -13.24 -1.13165729585007 0.116902409638554 )
( -12.22 -1.04190896921017 0.0967107095046854 )
( -11.22 -0.959060506050605 0.0820447744774477 )
( -10.19 -0.864225490196078 0.0690032679738562 )
( -9.7 -0.817688172043011 0.0637162485065711 )
( -9.18 -0.761537634408602 0.0561876941457587 )
( -8.18 -0.732598566308244 0.0254362007168459 )
( -7.19 -0.658289760348584 0.0170518518518518 )
( -6.65 -0.58420697167756 0.0156875816993464 )
( -6.13 -0.510906666666667 0.0144424444444444 )
( -6 -0.493888888888889 0.0113111111111111 )
( -5.5 -0.420666666666667 0.0101555555555556 )
( -5 -0.352111111111111 0.00938888888888889 )
( -4.5 -0.284444444444444 0.0089 )
( -4 -0.221333333333333 0.00878888888888889 )
( -3.5 -0.159111111111111 0.00858888888888889 )
( -3 -0.0905555555555556 0.00855555555555556 )
( -2.5 -0.0222222222222222 0.00845555555555556 )
( -2 0.0451111111111111 0.00845555555555556 )
( -1.5 0.112555555555556 0.00845555555555556 )
( -1 0.179111111111111 0.00845555555555556 )
( -0.5 0.245555555555556 0.00845555555555556 )
( 0 0.313888888888889 0.00836666666666667 )
( 0.5 0.379444444444444 0.00836666666666667 )
( 1 0.445888888888889 0.00846666666666667 )
( 1.5 0.511333333333333 0.00855555555555556 )
( 2 0.577777777777778 0.00865555555555556 )
( 2.5 0.642222222222222 0.00876666666666667 )
( 3 0.707555555555556 0.00887777777777778 )
( 3.5 0.771111111111111 0.009 )
( 4 0.835111111111111 0.00923333333333333 )
( 4.5 0.897555555555556 0.00941111111111111 )
( 5 0.960777777777778 0.00962222222222222 )
( 5.5 1.02322222222222 0.00994444444444444 )
( 6 1.08533333333333 0.0102333333333333 )
( 6.5 1.14655555555556 0.0105111111111111 )
( 7 1.20655555555556 0.0109666666666667 )
( 7.5 1.26355555555556 0.0115 )
( 8 1.31088888888889 0.0127444444444444 )
( 9 1.39144444444444 0.0157888888888889 )
( 9.5 1.42144444444444 0.0175444444444444 )
( 10 1.44688888888889 0.0199 )
( 10.5 1.46855555555556 0.0228111111111111 )
( 11 1.487 0.0265222222222222 )
( 11.5 1.50422222222222 0.0317444444444444 )
( 12 1.51822222222222 0.0380888888888889 )
( 12.5 1.52633333333333 0.0462333333333333 )
( 13 1.44811111111111 0.0630333333333333 )
( 13.5 1.38411111111111 0.0777111111111111 )
( 14 1.34488888888889 0.0917111111111111 )
( 14.5 1.329 0.106088888888889 )
( 15 1.32655555555556 0.1211 )
( 15.5 1.321 0.137722222222222 )
( 16 1.324 0.154511111111111 )
( 16.5 1.32266666666667 0.169044444444444 )
( 17 1.31933333333333 0.184355555555556 )
( 17.5 1.32844444444444 0.197955555555556 )
( 18 1.33022222222222 0.211666666666667 )
( 18.5 1.33644444444444 0.225066666666667 )
( 19 1.356 0.237888888888889 )
( 19.5 1.37366666666667 0.250555555555556 )
( 20 1.38833333333333 0.2611 )
( 20.5 1.41477777777778 0.273466666666667 )
( 21 1.42444444444444 0.2862 )
( 22 1.40233333333333 0.3163 )
( 23 1.37833333333333 0.347133333333333 )
( 24 1.35444444444444 0.378633333333333 )
( 25 1.32977777777778 0.410611111111111 )
( 26 1.30544444444444 0.442844444444444 )
( 28 1.26233333333333 0.507888888888889 )
( 30 1.23133333333333 0.572855555555556 )
( 32 1.21788888888889 0.636577777777778 )
( 35 1.22877777777778 0.729233333333333 )
( 40 1.22377777777778 0.879511111111111 )
( 45 1.18488888888889 1.02043333333333 )
( 50 1.11688888888889 1.14743333333333 )
( 55 1.02366666666667 1.25642222222222 )
( 60 0.910666666666667 1.34413333333333 )
( 65 0.782 1.40836666666667 )
( 70 0.644 1.44738888888889 )
( 75 0.499666666666667 1.46101111111111 )
( 80 0.355555555555556 1.4506 )
( 85 0.216333333333333 1.42212222222222 )
( 90 0.0876666666666667 1.40017777777778 )
( 95 -0.0347777777777778 1.40026666666667 )
( 100 -0.155333333333333 1.38531111111111 )
( 105 -0.272777777777778 1.3554 )
( 110 -0.385111111111111 1.31075555555556 )
( 115 -0.489444444444444 1.25196666666667 )
( 120 -0.584555555555555 1.17956666666667 )
( 125 -0.666666666666667 1.09454444444444 )
( 130 -0.733666666666667 0.998222222222222 )
( 135 -0.783555555555556 0.892011111111111 )
( 140 -0.813333333333333 0.777922222222222 )
( 145 -0.821 0.658366666666667 )
( 150 -0.802555555555556 0.5362 )
( 155 -0.755 0.4151 )
( 160 -0.677222222222222 0.299133333333333 )
( 170 -0.573777777777778 0.104188888888889 )
( 175 -0.287333333333333 0.0382 )
( 180 0 0.0257888888888889 )
); // // // //
